{
  "New Single Out Now": "游꿪 Noul Single Disponibil Acum",
  "INFLOW": "INFLOW",
  "Moldovas premier rock band Join us on our journey": "Trupa rock de top din Moldova. Al캒tur캒-te c캒l캒toriei noastre prin festivaluri, albume 탳i performan탵e live de neuitat care definesc muzica rock modern캒.",
  "Listen to Thunder Road": "Ascult캒 \"Thunder Road\"",
  "View Live Performances": "Vezi Performan탵ele Live",
  "50M+": "50M+",
  "Streams": "Stream-uri",
  "500K+": "500K+",
  "Monthly Listeners": "Ascult캒tori Lunari",
  "100+": "100+",
  "Shows Played": "Spectacole C칙ntate",
  "As Featured In": "Prezenta탵i 칉n",
  "A powerhouse performance that left the crowd begging for more": "O performan탵캒 puternic캒 care a l캒sat publicul s캒 cear캒 mai mult.",
  "Raw energy and incredible musicianship define this band": "Energie pur캒 탳i muzicalitate incredibil캒 definesc aceast캒 trup캒.",
  "They have mastered the art of stadium-shaking rock": "Au st캒p칙nit arta rock-ului care zguduie stadioane.",
  "Latest Single": "Ultimul Single",
  "Thunder Road": "Thunder Road",
  "Our most powerful track yet - a thunderous journey": "Cea mai puternic캒 pies캒 a noastr캒 p칙n캒 acum - o c캒l캒torie tunetoare prin emo탵ie pur캒 탳i sunet electrizant. Experimenteaz캒 energia care a captivat publicul din 칥ntreaga lume.",
  "Listen Now": "Ascult캒 Acum",
  "Live Performances": "Performan탵e Live",
  "See Us Live": "Vezi-ne Live",
  "Nothing compares to the raw energy of our live performances": "Nimic nu se compar캒 cu energia pur캒 a performan탵elor noastre live. Al캒tur캒-te miilor de fani 칥n timp ce aducem muzica la via탵캒 pe scen캒 la cele mai mari festivaluri din lume.",
  "View All Shows": "Vezi Toate Spectacolele",
  "Meet the Band": "칉nt칙lne탳te Trupa",
  "The Artists Behind the Music": "Arti탳tii Din Spatele Muzicii",
  "Get to know the talented musicians who pour their hearts": "Cunoa탳te muzicienii talenta탵i care 칥탳i pun inima 탳i sufletul 칥n fiecare performan탵캒. De la solourile arz캒toare ale chitaristului nostru principal la ritmurile tunetoare ale tobosarului.",
  "Home": "Acas캒",
  "Band": "Trup캒",
  "Festivals": "Festivaluri",
  "Music": "Muzic캒",
  "Contact": "Contact",
  "Toggle menu": "Deschide meniul",
  "Copyright 2024 INFLOW All rights reserved": "춸 2024 INFLOW. Toate drepturile rezervate.",
  "Follow Us": "Urm캒re탳te-ne",
  "Privacy Policy": "Politica de Confiden탵ialitate",
  "Terms of Service": "Termeni 탳i Condi탵ii",
  "Band Members": "Membri Trup캒",
  "Years Together": "Ani 칉mpreun캒",
  "Albums Released": "Albume Lansate",
  "Our Story": "Povestea Noastr캒",
  "INFLOW was formed in 2018 when four passionate musicians": "INFLOW a fost format캒 칥n 2018 c칙nd patru muzicieni pasiona탵i s-au unit cu o viziune comun캒: s캒 creeze muzic캒 care s캒 mi탳te oamenii at칙t emo탵ional, c칙t 탳i fizic. Ceea ce a 칥nceput ca sesiuni de improviza탵ie 칥ntr-un garaj din Detroit a evoluat 칥ntr-un act rock puternic care domin캒 scenele din 칥ntreaga lume.",
  "Our sound blends classic rock foundations": "Sunetul nostru 칥mbin캒 fundamentele rock clasice cu tehnici moderne de produc탵ie, cre칙nd imnuri care rezoneaz캒 at칙t cu fanii rock de lung캒 durat캒, c칙t 탳i cu noile genera탵ii care descoper캒 genul. Fiecare membru aduce propriile influen탵e 탳i experien탵a sa unic캒, rezult칙nd un sunet bogat 탳i stratificat care ne este distinct.",
  "From intimate club shows to major festival headlining slots": "De la spectacole intime 칥n cluburi la sloturi principale la festivaluri majore, ne-am construit reputa탵ia prin oferirea de performan탵e pline de energie care las캒 publicul s캒 cear캒 mai mult. Chimia noastr캒 pe scen캒 reflect캒 conexiunea muzical캒 profund캒 pe care am dezvoltat-o de-a lungul anilor de creare 탳i performan탵캒 칥mpreun캒.",
  "Experience Our Music Live": "Experimenteaz캒 Muzica Noastr캒 Live",
  "The best way to truly understand our music": "Cel mai bun mod de a 칥n탵elege cu adev캒rat muzica noastr캒 este s캒 o experimentezi live. Verific캒 spectacolele noastre viitoare 탳i vezi de ce performan탵ele noastre creeaz캒 v칙lv캒 칥n scena rock.",
  "Listen to Our Music": "Ascult캒 Muzica Noastr캒",
  "Get to know the talented musicians who bring our music to life": "Cunoa탳te muzicienii talenta탵i care aduc muzica noastr캒 la via탵캒. Fiecare membru aduce propriul stil, experien탵캒 탳i pasiune pentru a crea sunetul puternic care define탳te INFLOW.",
  "Play All": "Red캒 Toate",
  "Add to Queue": "Adaug캒 la Coad캒",
  "Singles": "Single-uri",
  "Our Music": "Muzica Noastr캒",
  "Discover our discography": "Descoper캒 discografia noastr캒 - de la single-uri puternice la albume complete care prezint캒 evolu탵ia noastr캒 ca arti탳ti.",
  "Festival Performances": "Performan탵e la Festivaluri",
  "Live shows and festival appearances": "Spectacole live 탳i apari탵ii la festivaluri care ne-au definit c캒l캒toria ca trup캒.",
  "Get In Touch": "Intr캒 칥n Leg캒tur캒",
  "Ready to connect": "Preg캒tit s캒 te conectezi? Fie c캒 e탳ti fan, loca탵ie sau profesionist din industrie, ne-ar pl캒cea s캒 auzim de la tine.",
  "Send Message": "Trimite Mesaj",
  "Name": "Nume",
  "Email": "Email",
  "Message": "Mesaj",
  "Your Name": "Numele T캒u",
  "Your Email": "Email-ul T캒u",
  "Your Message": "Mesajul T캒u"
}
